const Discord = require("discord.js");
// const client = new Discord.Client();
// const auth = require('./auth.json');


module.exports = (msg) => {
    const emb = new Discord.MessageEmbed()
        .setTitle('ตารางเรียนและกิจกรรม 64-65')
        .setColor(0xff0000)
        .setDescription('Update : 23 พ.ค. 64   ( 19.14 น. )\n( ข้อมูลจาก https://www1.reg.cmu.ac.th/webreg/th/calendar )')
        .addField("มิถุนายน 64","3 มิ.ย. : วันเฉลิมฯ พระบรมราชินี\n12 มิ.ย. : วันประชุมผู้ปกครอง\n13-16 มิ.ย. : จัดกิจกรรมคณะ-วิทยาลัย (รอประกาศจากทางคณะ)\n13-16 มิ.ย. : ปฐมนิเทศนักศึกษาใหม่ (ออนไลน์)\n17-18 มิ.ย. : ลงทะเบียนเรียน\n19-27 มิ.ย. : เพิ่ม-ถอนกระบวนวิชา (ทุกรหัส) (ออนไลน์)\n23 มิ.ย. : วันที่สภาวิชาการให้ความเห็นชอบการสำเร็จการศึกษา\n21 มิ.ย. : เปิดเทอม (ออนไลน์ ถึง 31 ก.ค. ส่วนที่เหลือรอดูสถานการณ์อีกที)\n28 มิ.ย. - 1 ก.ค. : แอดมือ (ทุกรหัส) (ออนไลน์)")
        .addField("กรกฏาคม 64","1 ก.ค. : วันไหว้ครู\n4 ก.ค. : สรุปผลการลงทะเบียนและค่าเทอม\n5-9 ก.ค. : จ่ายค่าเทอม\n5 ก.ค. - 10 ก.ย. : Drop โดยติด W \n21 ก.ค. : วันพ้นสภาพนักศึกษาที่ไม่ได้ลงทะเบียนและไม่ได้ลาพักการศึกษา\n26-28 ก.ค. : วันหยุดชดเชยวันอาสาฬหบูชา + หยุดชดเชยวันเข้าพรรษา + วันเฉลิมฯ ร.10")
        .addField("สิงหาคม 64","16-22 ส.ค. : สอบกลางภาค\n12 ส.ค. : วันแม่แห่งชาติ")
        .addField("กันยายน 64","10 ก.ย. : วันสุดท้ายของการ Drop โดยติด W (ออนไลน์)\n13-19 ก.ย. : ลงทะเบียนเรียนล่วงหน้า (ทุกรหัส) (ออนไลน์)\n24 ก.ย. : วันมหิดล\n28 ก.ย. : ประกาศผลลงทะเบียนเรียนล่วงหน้า (ออนไลน์)")
        .addField("ตุลาคม 64","11-29 ต.ค. : สอบปลายภาค\n13 ต.ค. : วันคล้ายวันสวรรคต ร.9\n22 ต.ค. : วันหยุดชดเชยวันปิยมหาราช")
        .addField("พฤศจิกายน 64","8 พ.ย. : ประกาศผลการศึกษา (ออนไลน์)\n6-14 พ.ย. : เพิ่ม-ถอนกระบวนวิชา (ออนไลน์)\n8 พ.ย. : เปิดเทอม\n19 พ.ย. : วันสุดท้ายของการ Drop โดยไม่ติด W\n21 พ.ย. : สรุปผลการลงทะเบียนและค่าเทอม (ออนไลน์)\n22-26 พ.ย. : จ่ายค่าเทอม\n22 พ.ย. - 28 ม.ค. : Drop โดยติด W (ออนไลน์)\n22-28 พ.ย. : รายงานตัวคาดว่าจะสำเร็จการศึกษา ป.ตรี\n 24 พ.ย. : วันที่สภาวิชาการให้ความเห็นชอบการสำเร็จการศึกษา")
        .addField("ธันวาคม 64","6 ธ.ค. : วันหยุดชดเชยวันพ่อแห่งชาติ\n8 ธ.ค. : วันพ้นสภาพนักศึกษาที่ไม่ได้ลงทะเบียนและไม่ได้ลาพักการศึกษา\n10 ธ.ค. : วันรัฐธรรมนูญ\n31 ธ.ค. : วันสิ้นปี")
        .addField("มกราคม 65","4-10 ม.ค. : สอบกลางภาค\n28 ม.ค. : วันสุดท้ายของการ Drop โดยติด W (ออนไลน์)")
        .addField("กุมภาพันธ์ 65","28 ก.พ. - 13 มี.ค. : สอบปลายภาค")
        .addField("มีนาคม 65","25 มี.ค. : ประกาศผลการศึกษา (ออนไลน์)\n28 มี.ค. - 1 เม.ย. : ลงทะเบียนเรียนล่วงหน้า (ออนไลน์)")
        .addField("เมษายน 65","3 เม.ย. : ประกาศผลลงทะเบียนเรียนล่วงหน้า (ออนไลน์)\n4-10 เม.ย. : เพิ่ม-ถอนกระบวนวิชา (ออนไลน์)\n18 เม.ย. : เปิดเทอม\n22 เม.ย. : วันสุดท้ายของการ Drop โดยไม่ติด W\n24 เม.ย. : สรุปผลการลงทะเบียนและค่าเทอม \n25 เม.ย. - 13 พ.ค. : Drop โดยติด W\n25-29 เม.ย. : จ่ายค่าเทอม\n25-29 เม.ย. : รายงานตัวคาดว่าจะสำเร็จการศึกษา ป.ตรี")
        .addField("พฤษภาคม 65","13 พ.ค. : วันสุดท้ายของการ Drop โดยติด W\n30 พ.ค. - 2 มิ.ย. : สอบปลายภาค (ตามกำหนดการจะไม่มีสอบกลางภาค)")
        .addField("มิถุนายน 65","9 มิ.ย. : ประกาศผลการศึกษา (ออนไลน์)\n22 มิ.ย. : วันที่สภาวิชาการให้ความเห็นชอบการสำเร็จการศึกษา")
        msg.channel.send(emb)
    }

        
