const Discord = require("discord.js");
// const client = new Discord.Client();
// const auth = require('./auth.json');


module.exports = (msg) => {
    const emb = new Discord.MessageEmbed()
        .setTitle('ตารางเรียนและกิจกรรม 65')
        .setColor(0xff0000)
        .setDescription('Update : 23 พ.ค. 64   ( 19.14 น. )\n( ข้อมูลจาก https://www1.reg.cmu.ac.th/webreg/th/calendar )')
        .addField("มกราคม 65","4-10 ม.ค. : สอบกลางภาค\n28 ม.ค. : วันสุดท้ายของการ Drop โดยติด W (ออนไลน์)")
        .addField("กุมภาพันธ์ 65","28 ก.พ. - 13 มี.ค. : สอบปลายภาค")
        .addField("มีนาคม 65","25 มี.ค. : ประกาศผลการศึกษา (ออนไลน์)\n28 มี.ค. - 1 เม.ย. : ลงทะเบียนเรียนล่วงหน้า (ออนไลน์)")
        .addField("เมษายน 65","3 เม.ย. : ประกาศผลลงทะเบียนเรียนล่วงหน้า (ออนไลน์)\n4-10 เม.ย. : เพิ่ม-ถอนกระบวนวิชา (ออนไลน์)\n18 เม.ย. : เปิดเทอม\n22 เม.ย. : วันสุดท้ายของการ Drop โดยไม่ติด W\n24 เม.ย. : สรุปผลการลงทะเบียนและค่าเทอม \n25 เม.ย. - 13 พ.ค. : Drop โดยติด W\n25-29 เม.ย. : จ่ายค่าเทอม\n25-29 เม.ย. : รายงานตัวคาดว่าจะสำเร็จการศึกษา ป.ตรี")
        .addField("พฤษภาคม 65","13 พ.ค. : วันสุดท้ายของการ Drop โดยติด W\n30 พ.ค. - 2 มิ.ย. : สอบปลายภาค (ตามกำหนดการจะไม่มีสอบกลางภาค)")
        .addField("มิถุนายน 65","9 มิ.ย. : ประกาศผลการศึกษา (ออนไลน์)\n22 มิ.ย. : วันที่สภาวิชาการให้ความเห็นชอบการสำเร็จการศึกษา")
        msg.channel.send(emb)
}